#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПраво(Форма);
		ДобавитьПолеСогласованнаяСкидка(Форма);
		ДобавитьКнопкуПересчитать(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
		
КонецПроцедуры	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоПраво(Форма)

   ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.net_КонтактноеЛицо";

КонецПроцедуры                                                                                   

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)

   ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Неопределено, Форма.Элементы.СуммаДокумента);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
   ПолеВвода.ПутьКДанным = "Объект.net_КонтактноеЛицо";

КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидка(Форма)

   ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
   ПолеВвода.ПутьКДанным = "Объект.net_СогласованнаяСкидка";
   ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменени");

КонецПроцедуры 

Процедура ДобавитьКнопкуПересчитать(Форма)
	
	Команда = Форма.Команды.Добавить("Пересчитать");
	Команда.Заголовок = "Пересчитать";
	Команда.Действие = "КомандаПересчитать";
	
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитать", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "Пересчитать";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры	
 
#КонецОбласти